openshwprojects/OpenBK7231T_App/libraries/ESP32_Display_Panel/test_apps/board/common/sdkconfig.ci.custom.BOARD_ESPRESSIF_ESP32_S3_LCD_EV_BOARD_V1_5
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_ESP_PANEL_BOARD_DEFAULT_USE_CUSTOM=y
CONFIG_ESP_PANEL_BOARD_NAME="Custom_ESP32_S3_LCD_EV_BOARD_V1_5"
CONFIG_ESP_PANEL_BOARD_WIDTH=480
CONFIG_ESP_PANEL_BOARD_HEIGHT=480
CONFIG_ESP_PANEL_BOARD_USE_LCD=y
CONFIG_ESP_PANEL_LCD_CONTROLLER_GC9503=y
CONFIG_ESP_PANEL_BOARD_LCD_BUS_TYPE_RGB=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_SPI_IO_CS=1
CONFIG_ESP_PANEL_BOARD_LCD_RGB_SPI_IO_SCK=2
CONFIG_ESP_PANEL_BOARD_LCD_RGB_SPI_IO_SDA=3
CONFIG_ESP_PANEL_BOARD_LCD_RGB_SPI_CS_USE_EXPNADER=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_SPI_SCL_USE_EXPNADER=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_SPI_SDA_USE_EXPNADER=y
CONFIG_ESP_PANEL_BOARD_LCD_RGB_BOUNCE_BUF_SIZE=4800
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA6=8
CONFIG_ESP_PANEL_BOARD_LCD_RGB_IO_DATA7=18
CONFIG_ESP_PANEL_BOARD_LCD_FLAGS_ENABLE_IO_MULTIPLEX=y
CONFIG_ESP_PANEL_BOARD_LCD_COLOR_BITS_RGB666=y
CONFIG_ESP_PANEL_BOARD_USE_TOUCH=y
CONFIG_ESP_PANEL_BOARD_TOUCH_CONTROLLER_FT5x06=y
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_IO_SCL=48
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_IO_SDA=47
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_SCL_PULLUP=n
CONFIG_ESP_PANEL_BOARD_TOUCH_I2C_SDA_PULLUP=n
CONFIG_ESP_PANEL_BOARD_USE_EXPANDER=y
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_ADDRESS=32
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_IO_SCL=48
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_IO_SDA=47
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_SCL_PULLUP=n
CONFIG_ESP_PANEL_BOARD_EXPANDER_I2C_SDA_PULLUP=n
